DataProcessors/МП_ЗаполнениеПроцентыТайногоПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>МП_ЗаполнениеПроцентыТайногоПокупателя</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокМагазинов</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/МП_ЗаполнениеПроцентыТайногоПокупателя/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ДатаВыполнения=ТекущаяДата();
	Обработки.МП_ЗаполнениеПроцентыТайногоПокупателя.ЗаполнитьСписокМагазинов(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого Элемент Из Объект.СписокМагазинов Цикл
		Элемент.Пометка = Истина;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	
	Для Каждого Элемент Из Объект.СписокМагазинов Цикл
		Элемент.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере() Экспорт

	Обработки.МП_ЗаполнениеПроцентыТайногоПокупателя.СформироватьНаСервере(Объект);

КонецПроцедуры // СформироватьНаСервере()
